# CSV read and write with pandas

# Document

<table align="left">
    <tr>
        <th class="text-align:left">Title</th>
        <td class="text-align:left">CSV read and write in pandas</td>
    </tr>
    <tr>
        <th class="text-align:left">Last modified</th>
        <td class="text-align:left">2018-09-10</td>
    </tr>
    <tr>
        <th class="text-align:left">Author</th>
        <td class="text-align:left">Gilles Pilon <gillespilon13@gmail.com></td>
    </tr>
    <tr>
        <th class="text-align:left">Status</th>
        <td class="text-align:left">Active</td>
    </tr>
    <tr>
        <th class="text-align:left">Type</th>
        <td class="text-align:left">Jupyter notebook</td>
    </tr>
    <tr>
        <th class="text-align:left">Created</th>
        <td class="text-align:left">2018-09-10</td>
    </tr>
    <tr>
        <th class="text-align:left">File name</th>
        <td class="text-align:left">csv_read_write_pandas.ipynb</td>
    </tr>
    <tr>
        <th class="text-align:left">Other files required</th>
        <td class="text-align:left"></td>
    </tr>
</table>

# In brevi

The purpose of this Jupyter notebook is to illustrate how to read and write CSV files with pandas.

# Code

In [1]:
# Import librairies
import pandas as pd

/home/gilles/.pyenv/versions/3.6.6/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/home/gilles/.pyenv/versions/3.6.6/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [2]:
# Create a dataframe to write and read.
data = {'first':  ['Moe', 'Larry', 'Curly', 'Shemp', 'Joe'],
        'last':   ['Howard', 'Fine', 'Howard', 'Howard', 'DeRita'],
        'age':    [78, 73, 49, 60, 84],
        'height': [114, 124, 131, '.', '.'],
        'weight': ['25,000', '94,000', 157, 162, 170]
       }
df = pd.DataFrame.from_dict(data, orient='columns')
df

   first    last  age height  weight
0    Moe  Howard   78    114  25,000
1  Larry    Fine   73    124  94,000
2  Curly  Howard   49    131     157
3  Shemp  Howard   60      .     162
4    Joe  DeRita   84      .     170

In [3]:
# Write the dataframe to the current working directory.
df.to_csv('data.csv')

In [4]:
# Read a data file to a dataframe.
df = pd.read_csv('data.csv')
df

   Unnamed: 0  first    last  age height  weight
0           0    Moe  Howard   78    114  25,000
1           1  Larry    Fine   73    124  94,000
2           2  Curly  Howard   49    131     157
3           3  Shemp  Howard   60      .     162
4           4    Joe  DeRita   84      .     170

In [5]:
# Read a data file to a dataframe.
# Read the column labels as if they were data.
df= pd.read_csv('data.csv', header=None)
df

     0      1       2    3       4       5
0  NaN  first    last  age  height  weight
1  0.0    Moe  Howard   78     114  25,000
2  1.0  Larry    Fine   73     124  94,000
3  2.0  Curly  Howard   49     131     157
4  3.0  Shemp  Howard   60       .     162
5  4.0    Joe  DeRita   84       .     170

In [6]:
# Read a data file to a dataframe. Specify the column labels.
df = pd.read_csv('data.csv',
                 names = ['ID', 'First', 'Last', 'Age', 'Ht', 'Wt'])
df

    ID  First    Last  Age      Ht      Wt
0  NaN  first    last  age  height  weight
1  0.0    Moe  Howard   78     114  25,000
2  1.0  Larry    Fine   73     124  94,000
3  2.0  Curly  Howard   49     131     157
4  3.0  Shemp  Howard   60       .     162
5  4.0    Joe  DeRita   84       .     170

In [7]:
# Read a data file to a dataframe. Specify the column labels.
# Skip first row of the file, which are column names.
df = pd.read_csv('data.csv',
                 skiprows=1,
                 names = ['ID', 'First', 'Last', 'Age', 'Ht', 'Wt'])
df

   ID  First    Last  Age   Ht      Wt
0   0    Moe  Howard   78  114  25,000
1   1  Larry    Fine   73  124  94,000
2   2  Curly  Howard   49  131     157
3   3  Shemp  Howard   60    .     162
4   4    Joe  DeRita   84    .     170

In [8]:
# Read a data file to a dataframe. Specify the column labels.
# Skip first row of the file, which are column names.
# Set the index column to ID.
df = pd.read_csv('data.csv',
                 skiprows=1, index_col='ID',
                 names = ['ID', 'First', 'Last', 'Age', 'Ht', 'Wt'])
df

    First    Last  Age   Ht      Wt
ID
0     Moe  Howard   78  114  25,000
1   Larry    Fine   73  124  94,000
2   Curly  Howard   49  131     157
3   Shemp  Howard   60    .     162
4     Joe  DeRita   84    .     170